=~=~=~=~=~=~=~=~=~=~=~= PuTTY log 2025.08.24 13:48:21 =~=~=~=~=~=~=~=~=~=~=~=
login as: adi min
Keyboard-interactive authentication prompts from server:
| Password: 
End of keyboard-interactive prompts from server
Access denied
Keyboard-interactive authentication prompts from server:
| Password: 
End of keyboard-interactive prompts from server
C
* Authorized access only *

R3#terminal length 0
R3#show clock
19:48:18.410 CDT Sun Aug 24 2025
R3#show version | include uptime|System image|bytes of memory
R3 uptime is 1 hour, 8 minutes
System image file is "flash:c2800nm-adventerprisek9-mz.151-4.M10.bin"
Cisco 2851 (revision 1.0) with 249856K/12288K bytes of memory.
R3#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0         10.2.2.2        YES NVRAM  up                    up      
GigabitEthernet0/1         192.168.100.1   YES NVRAM  up                    up      
Serial0/0/0                unassigned      YES NVRAM  administratively down down    
Loopback0                  3.3.3.3         YES NVRAM  up                    up      
R3#show ip route summary
IP routing table name is default (0x0)
IP routing table maximum-paths is 32
Route Source    Networks    Subnets     Replicates  Overhead    Memory (bytes)
connected       0           5           0           300         880
static          1           0           0           60          176
bgp 65003       3           1           0           240         704
  External: 4 Internal: 0 Local: 0
internal        4                                               1508
Total           8           6           0           600         3268
R3#show ip route 192.168.100.0
Routing entry for 192.168.100.0/24, 2 known subnets
  Attached (2 connections)
  Variably subnetted with 2 masks
C        192.168.100.0/24 is directly connected, GigabitEthernet0/1
L        192.168.100.1/32 is directly connected, GigabitEthernet0/1
R3#show ip bgp summary
BGP router identifier 3.3.3.3, local AS number 65003
BGP table version is 31, main routing table version 31
6 network entries using 816 bytes of memory
6 path entries using 336 bytes of memory
2/2 BGP path/bestpath attribute entries using 256 bytes of memory
1 BGP AS-PATH entries using 24 bytes of memory
0 BGP route-map cache entries using 0 bytes of memory
0 BGP filter-list cache entries using 0 bytes of memory
BGP using 1432 total bytes of memory
BGP activity 18/12 prefixes, 18/12 paths, scan interval 60 secs

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.2.2.1        4        65001      15      14       31    0    0 00:08:56        4
R3#show ip bgp neighbors | include BGP state|Local host
  BGP state = Established, up for 00:08:56
Local host: 10.2.2.2, Local port: 179
R3#show standby brief
R3#show ip nat statistics
R3#show policy-map control-plane
R3#show policy-map type inspect zone-pair
R3#show access-lists VLAN10-IN
R3#exit
